#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.realfire_au.cloudflare_record.terraform_managed_resource_b007352f3aab9a5cbf1a2360333cd9e8: Refreshing state... [id=b007352f3aab9a5cbf1a2360333cd9e8]
module.protectedpii_com.cloudflare_record.dmarc: Refreshing state... [id=dddea226ef92db2c65f2ea2c8e01d0f5]
module.realfire_cloud.cloudflare_record.mc2-a: Refreshing state... [id=a0af5c72c29748e68982ced1c5dc2f6a]
module.realfire_cloud.cloudflare_record.mc-srv: Refreshing state... [id=5fa1192a6474fc2aaa715ddd3ba7ccf2]
module.realfire_cloud.cloudflare_record.mc2-srv: Refreshing state... [id=7eecf66faabd9a85da53e598ef1e8431]
module.protectedpii_com.cloudflare_record.fastmail-dkim3: Refreshing state... [id=d8ab9d9888d8412f89d8d2f58994c758]
module.realfire_dev.cloudflare_record.discord-dv: Refreshing state... [id=15b07be1b1d6103117de1cf54d6df622]
module.realfire_au.cloudflare_record.terraform_managed_resource_b5500d4b699a1e57af92ba3ed030c37e: Refreshing state... [id=b5500d4b699a1e57af92ba3ed030c37e]
module.realfire_dev.cloudflare_record.mx2: Refreshing state... [id=59094dbe266e0ec82604fe359036edb0]
module.realfire_link.cloudflare_record.terraform_managed_resource_edc1472a0262c4b18110a68391c6a080: Refreshing state... [id=edc1472a0262c4b18110a68391c6a080]
module.realfire_dev.cloudflare_record.fastmail-dkim3: Refreshing state... [id=5c6ce608978b45846ffdde8eccc1f8ad]
module.realfire_cloud.cloudflare_record.mc-a: Refreshing state... [id=70b3924fce9c4a246125f5f888bbbe4c]
module.protectedpii_com.cloudflare_record.spf: Refreshing state... [id=7ccb3399105f0b8def4f594f8583c52f]
module.realfire_link.cloudflare_record.terraform_managed_resource_4f093e0e15b521612f05d72708c92968: Refreshing state... [id=4f093e0e15b521612f05d72708c92968]
module.realfire_link.cloudflare_record.terraform_managed_resource_04ef8770273f24a074905cf94aa0eb81: Refreshing state... [id=04ef8770273f24a074905cf94aa0eb81]
module.protectedpii_com.cloudflare_record.mx: Refreshing state... [id=0cbed3f5d1f28eff16734da3fbc29d16]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_b2c5dd3a2faeda844cfceeff25f5c827: Refreshing state... [id=b2c5dd3a2faeda844cfceeff25f5c827]
module.realfire_dev.cloudflare_record.homepage: Refreshing state... [id=9e7d1b63c7a33ca7bf16ed3f4d3b4115]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_6910f22baeb25b9122f798ffc168ad21: Refreshing state... [id=6910f22baeb25b9122f798ffc168ad21]
module.realfire_dev.cloudflare_record.fastmail-dkim2: Refreshing state... [id=42e462ff3cc7def840b264284cb681c7]
module.realfire_dev.cloudflare_record.mx4: Refreshing state... [id=844156ee37bed8e029207d117dfdd3e5]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_1b00ada15f8487843dc8e90f51defc59: Refreshing state... [id=1b00ada15f8487843dc8e90f51defc59]
module.protectedpii_com.cloudflare_record.fastmail-dkim2: Refreshing state... [id=0120155210a5a4aefb8c81d4459d4e7a]
module.realfire_dev.cloudflare_record.fastmail-dkim1: Refreshing state... [id=7e9f2ace3899d663a8187e30c63eae7e]
module.protectedpii_com.cloudflare_record.fastmail-dkim1: Refreshing state... [id=512294b89b48a445eb020241cf58da62]
module.realfire_dev.cloudflare_record.mx3: Refreshing state... [id=00198b15d667efe779667887af414ef9]
module.protectedpii_com.cloudflare_record.mx2: Refreshing state... [id=652476864062ec2f7084b6d6af6692ab]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_5c5abc0fdccae3cbb41c7396281f3aba: Refreshing state... [id=5c5abc0fdccae3cbb41c7396281f3aba]
module.realfire_dev.cloudflare_record.spf: Refreshing state... [id=a04900f1cff0cc9df186393625e9d629]
module.realfire_au.cloudflare_record.terraform_managed_resource_71ecf873ed39bc95ac289c5fbdd53a80: Refreshing state... [id=71ecf873ed39bc95ac289c5fbdd53a80]
module.realfire_au.cloudflare_record.terraform_managed_resource_ac8ab0f6be08bcffce56effa487da6ca: Refreshing state... [id=ac8ab0f6be08bcffce56effa487da6ca]
module.realfire_link.cloudflare_record.terraform_managed_resource_2726bfcb3d4468cd0087c2a57d005f6c: Refreshing state... [id=2726bfcb3d4468cd0087c2a57d005f6c]
module.realfire_dev.cloudflare_record.dmarc: Refreshing state... [id=456bc27d090bc1bccd3ec0247e514feb]
module.realfire_dev.cloudflare_record.mx1: Refreshing state... [id=e20a1ba9cd2b4da5da3a43db02d6ae93]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.realfire_cloud.cloudflare_record.mc2-a will be destroyed
  # (because cloudflare_record.mc2-a is not in configuration)
  - resource "cloudflare_record" "mc2-a" {
      - allow_overwrite = false -> null
      - created_on      = "2024-06-15T03:03:35.439213Z" -> null
      - hostname        = "goobersofoz.realfire.cloud" -> null
      - id              = "a0af5c72c29748e68982ced1c5dc2f6a" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-06-15T03:03:35.439213Z" -> null
      - name            = "goobersofoz" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "13.211.139.119" -> null
      - zone_id         = "1f019c7820ff055bf1009958be12488a" -> null
        # (1 unchanged attribute hidden)
    }

  # module.realfire_cloud.cloudflare_record.mc2-srv will be destroyed
  # (because cloudflare_record.mc2-srv is not in configuration)
  - resource "cloudflare_record" "mc2-srv" {
      - allow_overwrite = false -> null
      - created_on      = "2024-06-15T03:03:35.676939Z" -> null
      - hostname        = "_minecraft._tcp.goobersofoz.realfire.cloud" -> null
      - id              = "7eecf66faabd9a85da53e598ef1e8431" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-06-15T03:03:35.676939Z" -> null
      - name            = "_minecraft._tcp.goobersofoz.realfire.cloud" -> null
      - priority        = 0 -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "SRV" -> null
      - value           = "0 25574 goobersofoz.realfire.cloud" -> null
      - zone_id         = "1f019c7820ff055bf1009958be12488a" -> null
        # (1 unchanged attribute hidden)

      - data {
          - algorithm      = 0 -> null
          - altitude       = 0 -> null
          - digest_type    = 0 -> null
          - key_tag        = 0 -> null
          - lat_degrees    = 0 -> null
          - lat_minutes    = 0 -> null
          - lat_seconds    = 0 -> null
          - long_degrees   = 0 -> null
          - long_minutes   = 0 -> null
          - long_seconds   = 0 -> null
          - matching_type  = 0 -> null
          - name           = "goobersofoz.realfire.cloud" -> null
          - order          = 0 -> null
          - port           = 25574 -> null
          - precision_horz = 0 -> null
          - precision_vert = 0 -> null
          - preference     = 0 -> null
          - priority       = 0 -> null
          - proto          = "_tcp" -> null
          - protocol       = 0 -> null
          - selector       = 0 -> null
          - service        = "_minecraft" -> null
          - size           = 0 -> null
          - target         = "goobersofoz.realfire.cloud" -> null
          - type           = 0 -> null
          - usage          = 0 -> null
          - weight         = 0 -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.realfire_network.cloudflare_record.mc2-a will be created
  + resource "cloudflare_record" "mc2-a" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "goobers"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "13.211.139.119"
      + zone_id         = "fc42edd047c0e37cb551da3fac654265"
    }

  # module.realfire_network.cloudflare_record.mc2-srv will be created
  + resource "cloudflare_record" "mc2-srv" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_minecraft._tcp.goobers.realfire.network"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = "fc42edd047c0e37cb551da3fac654265"

      + data {
          + name     = "goobers.realfire.network"
          + port     = 25565
          + priority = 0
          + proto    = "_tcp"
          + service  = "_minecraft"
          + target   = "goobers.realfire.network"
          + weight   = 0
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @RealFireAU, Action: `pull_request`, Workflow: `Terraform Plan`*